In [1]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
# Using columns assignment to change columns name
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
# Using list comprehension to change a column attribute
df.columns = [x.lower() for x in df.columns]

In [12]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [14]:
# Changing a particular column
df.rename(columns={
    'first_name': 'first',
    'last_name': 'last',
}, inplace=True)

In [15]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

Updating a Row

In [17]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [18]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [20]:
df.loc[2, ["last", "email"]] = ['Doe', 'JohnDoe@email.com']

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [23]:
# Changing multiple rows
df['email'] = df['email'].str.lower()

using apply, map, applymap and replace to update rows

In [24]:
# Using apply on a Series
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [25]:
# Simple function to use on our dataset
def update_email(email):
    return email.upper()

In [26]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [27]:
df['email'] = df['email'].apply(update_email)

In [28]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John      Doe        JOHNDOE@EMAIL.COM

In [30]:
# Convert to lower using lamda function
df['email'] = df['email'].apply(lambda x: x.lower())

In [31]:
# Using apply on a Dataframe
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [32]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [33]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [34]:
# Using applymap, applies a function to each individual element in a dataframe
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [35]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe        johndoe@email.com

In [36]:
# Using map, works only on a series
df['first'].map({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [37]:
# Using map, works only on a series
df['first'].replace({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object